Seeing this with `v0.15.0` as well, Terraform apply fails:

```
module.postgresql-database.juju_application.backups_s3_integrator[0]: Creation complete after 15m5s [id=stg-is-dbaas-testing:backups-s3-integrator]
╷
│ Error: Provider produced inconsistent result after apply
│
│ When applying changes to module.postgresql-database.juju_application.postgresql, provider "provider[\"registry.terraform.io/juju/juju\"]" produced an
│ unexpected new value: .constraints: was cty.StringVal("arch=amd64 cores=2 mem=4096M root-disk=20G"), but now cty.StringVal("arch=amd64 cores=2 mem=4096M
│ root-disk=20480M").
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
```

Then next run causes destruction because of the constraint differences:

```
  # module.postgresql-database.juju_application.postgresql is tainted, so must be replaced
-/+ resource "juju_application" "postgresql" {
      ~ constraints = "arch=amd64 cores=2 mem=4096M root-disk=20480M" -> "arch=amd64 cores=2 mem=4096M root-disk=20G"
      ~ id          = "stg-is-dbaas-testing:postgresql" -> (known after apply)
        name        = "postgresql"
      ~ placement   = "2,3,4" -> (known after apply)
      + principal   = (known after apply)
      ~ storage     = [
          - {
              - count = 1 -> null
              - label = "pgdata" -> null
              - pool  = "rootfs" -> null
              - size  = "20G" -> null
            },
          - {
              - count = 1 -> null
              - label = "pgdata-1" -> null
              - pool  = "rootfs" -> null
              - size  = "20G" -> null
            },
          - {
              - count = 1 -> null
              - label = "pgdata-2" -> null
              - pool  = "rootfs" -> null
              - size  = "20G" -> null
            },
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ charm {
            name     = "postgresql"
          ~ series   = "jammy" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }
```